GREETING_MESSAGE = """
Привет, {user_name}!

TripMaster – ваш личный планировщик путешествий!

Этот Telegram-бот поможет вам легко и удобно организовать поездку.

Баланс: {balance}


"""

MANUAL_MESSAGE = """
Инструкция
"""

BALANCE_MESSAGE = """
Пополнение 
"""

SUPPORT_TEH_MESS = """
*Техническая поддержка приложения "TripMaster"*

Наше приложение разработано командой из четырех создателей\:
@mabus777  
@Egor\_goryachev  
@jasperinina  
@Ingviar  

Если у вас возникли технические неполадки, ошибки или вопросы по использованию приложения, пожалуйста, свяжитесь с одним из разработчиков\.  
Мы всегда готовы помочь вам и оперативно решить проблему\!

Приятных путешествий и удобного планирования\!
"""

GUIDE_MESSAGE = """
1. Основные команды
/start — запуск бота и отображение главного меню.

2. Главное меню
Инструкция — краткое руководство по использованию бота.

Создать маршрут — начать создание нового маршрута.

Пополнить баланс — управление балансом токенов.

Календарь — работа с Google Календарём.

Сохраненные маршруты — просмотр ранее созданных маршрутов.

3. Создание маршрута
Нажмите Создать маршрут.

Выберите дату начала поездки в календаре.

Укажите города маршрута:

Введите начальный и конечный город.

Добавьте промежуточные города (при необходимости).

Укажите количество дней пребывания в каждом городе:

Используйте кнопки + и - для изменения дней.

Подтвердите выбор кнопкой ✅ Готово.

После завершения маршрут сохранится автоматически.

Для просмотра маршрута на карте нажмите Открыть карту.
"""