GREETING_MESSAGE = """
Привет, {user_name}!

TripMaster – ваш личный планировщик путешествий!

Этот Telegram-бот поможет вам легко и удобно организовать поездку.


"""

MANUAL_MESSAGE = """
Инструкция
"""

TEST_BALANCE_MESSAGE = """
Пополнение 
"""

SUPPORT_TEH_MESS = """
🔹 Техническая поддержка приложения "Планировщик путешествий" 🔹

Наше приложение разработано командой из четырех создателей:
👨‍💻 @mabus777
👨‍💻 @Egor_goryachev
👨‍💻 @jasperinina
👨‍💻 @Ingviar

Если у вас возникли технические неполадки, ошибки или вопросы по использованию приложения, пожалуйста, свяжитесь с одним из разработчиков. Мы всегда готовы помочь вам и оперативно решить проблему! 🚀

Приятных путешествий и удобного планирования! 🌍✨
"""